Tekla Open API Reference for Tekla Structures 2025
DrawingObject.NoAttributes Class
 The NoAttributes class defines attributes for objects that do not contain any attributes.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.DrawingObject.NoAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class NoAttributes : AttributesBase
<SerializableAttribute>
Public NotInheritable Class NoAttributes
	Inherits AttributesBase
The DrawingObject.NoAttributes type exposes the following members.
Constructors
Name | Description
DrawingObject.NoAttributes()
 Creates a new default no attributes instance.
DrawingObject.NoAttributes(String)
 Creates a new no attributes instance. No attributes are loaded from the attribute file as it is not possible to load attributes for objects of this type.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 It is not possible to load attributes for objects of this type because the objects have no attributes.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace